## Data Input and Output

In [1]:
import pandas as pd
import numpy as np

In [2]:
pwd

'/home/rthomas/Dropbox/Edu/Python-for-Finance-Repo-master/03- General Pandas'

In [3]:
ls

01-Introduction-to-Pandas.ipynb
02-Series.ipynb
03-DataFrames.ipynb
04-Missing-Data.ipynb
05-Groupby.ipynb
06-Merging-Joining-and-Concatenating.ipynb
07-Operations.ipynb
08-Data-Input-and-Output.ipynb
example
Excel_Sample.xlsx
multi_index_example
Pandas-Exercises/
RT-DataFrames3MissingValuesGroupByJoins.html
RT-DataFrames3MissingValuesGroupByJoins.ipynb
RT-Operations.html
RT-Operations.ipynb
RT-SeriesAndDataFrames1and2.html
RT-SeriesAndDataFrames1and2.ipynb
Untitled.ipynb

In [4]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
# can import Excel files but only data not formulas or macros
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [21]:
# put the csv file into a dataframe
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
# in the same way that you can read from files, you can write to files  <Shift><Tab> after df.to_ brings up list
# make index=False to avoid writing the index into the file
df.to_csv('RT_example', index=False)

In [9]:
pd.read_csv('RT_example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
# can name the individual sheet to read from within an Excel file
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
# can write to an Excel file
df.to_excel('RT_example.xlsx', sheet_name='New Sheet')

In [25]:
# can read in html files from a website as well (how cool is this)
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [22]:
# takes each item in the html page and makes a dataframe, overall making a list
type(data)

list

## Working with SQL

In [26]:
# create a basic SQL engine in memory to work with for demonstration
# normally, need to import specific drivers to work with individual SQL engines
from sqlalchemy import create_engine

In [29]:
engine = create_engine('sqlite:///:memory:')

In [30]:
# Now can take a dataframe and write it to a named table in the database engine currently running in memory
df.to_sql('my_table', engine)

In [31]:
# make a dataframe by reading from a named table - must also state the engine in the con parameter
sqldf = pd.read_sql('my_table', con=engine)

In [32]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15